;---------------------------
; MrK's XCOM EU/EW Ports Tier 2 Armour
;---------------------------
;Tier 2
;---------------------------
;Skele3
[X1_Helmet_skele3_M X2BodyPartTemplate]
DisplayName="X-COM Carapace Helmet"
[X1_Helmet_skele3_F X2BodyPartTemplate]
DisplayName="X-COM Carapace Helmet"

;Carapace1
[X1_Helmet_Carapace1_M X2BodyPartTemplate]
DisplayName="X-COM Carapace 1 Helmet"
[X1_Helmet_Carapace1_F X2BodyPartTemplate]
DisplayName="X-COM Carapace 1 Helmet"

;Carapace2
[X1_Helmet_Carapace2_M X2BodyPartTemplate]
DisplayName="X-COM Carapace 2 Helmet"
[X1_Helmet_Carapace2_F X2BodyPartTemplate]
DisplayName="X-COM Carapace 2 Helmet"

;Carapaceatmo
[X1_Helmet_Carapaceatmo_M X2BodyPartTemplate]
DisplayName="X-COM Carapace Atmospheric Helmet"
[X1_Helmet_Carapaceatmo_F X2BodyPartTemplate]
DisplayName="X-COM Carapace Atmospheric Helmet"

;Carapaceopen
[X1_Helmet_CarapaceOpen_M X2BodyPartTemplate]
DisplayName="X-COM Carapace Open Helmet"
[X1_Helmet_CarapaceOpen_F X2BodyPartTemplate]
DisplayName="X-COM Carapace Open Helmet"

;Heavy Carapace
[X1_Helmet_Carapaceheavy_M X2BodyPartTemplate]
DisplayName="X-COM Heavy Carapace Helmet"
[X1_Helmet_Carapaceheavy_F X2BodyPartTemplate]
DisplayName="X-COM Heavy Carapace Helmet"

;Armour
;---------------------------

;Tier 2
;---------------------------
;Carapace Armour
;---------------------------

;Carapace Base Arms
[X1_CarapacearmsR_LP_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsR_MP_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsR_HP_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsL_LP_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsL_MP_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsL_HP_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"

[X1_CarapacearmsR_LP_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsR_MP_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsR_HP_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsL_LP_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsL_MP_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsL_HP_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"

[X1_CarapacearmsR_LP_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"
[X1_CarapacearmsR_MP_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"
[X1_CarapacearmsR_HP_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"
[X1_CarapacearmsL_LP_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"
[X1_CarapacearmsL_MP_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"
[X1_CarapacearmsL_HP_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"

;Serpent Armour
[X1_CarapacearmsR_LA_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsL_LA_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsR_LA_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsL_LA_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsR_LA_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"
[X1_CarapacearmsL_LA_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"

[X1_CarapacearmsR_LA2_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsL_LA2_M X2BodyPartTemplate]
DisplayName="Base Carapace Arm"
[X1_CarapacearmsR_LA2_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsL_LA2_F X2BodyPartTemplate]
DisplayName="Base Carapace Arm EW"
[X1_CarapacearmsR_LA2_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"
[X1_CarapacearmsL_LA2_FEU X2BodyPartTemplate]
DisplayName="Base Carapace Arm EU"

;Tier 2
;---------------------------
;Skeleton Armour
;---------------------------

;Skeleton Base Arms
[X1_skeletonarmsR_LP_M X2BodyPartTemplate]
DisplayName="Base Skeleton Arm"
[X1_skeletonarmsR_MP_M X2BodyPartTemplate]
DisplayName="Base Skeleton Arm"
[X1_skeletonarmsR_HP_M X2BodyPartTemplate]
DisplayName="Base Skeleton Arm"
[X1_skeletonarmsL_LP_M X2BodyPartTemplate]
DisplayName="Base Skeleton Arm"
[X1_skeletonarmsL_MP_M X2BodyPartTemplate]
DisplayName="Base Skeleton Arm"
[X1_skeletonarmsL_HP_M X2BodyPartTemplate]
DisplayName="Base Skeleton Arm"

[X1_skeletonarmsR_LP_F X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EW"
[X1_skeletonarmsR_MP_F X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EW"
[X1_skeletonarmsR_HP_F X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EW"
[X1_skeletonarmsL_LP_F X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EW"
[X1_skeletonarmsL_MP_F X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EW"
[X1_skeletonarmsL_HP_F X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EW"

[X1_skeletonarmsR_LP_FEU X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EU"
[X1_skeletonarmsR_MP_FEU X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EU"
[X1_skeletonarmsR_HP_FEU X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EU"
[X1_skeletonarmsL_LP_FEU X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EU"
[X1_skeletonarmsL_MP_FEU X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EU"
[X1_skeletonarmsL_HP_FEU X2BodyPartTemplate]
DisplayName="Base Skeleton Arm EU"

;Deco
;---------------------------

;Tier 2
;---------------------------
Conventional AR Kit
;---------------------------
[X1_KitIIConvR_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvR_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvR_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"

[X1_KitIIConvR_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvR_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvR_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"

[X1_KitIIConvThighs_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvThighs_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvThighs_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvThighs_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvThighs_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvThighs_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"

[X1_KitIIConvShins_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvShins_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvShins_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvShins_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvShins_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvShins_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"

;Serpent Armour
[X1_KitIIConvR_LA_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_LA_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvR_LA_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_LA_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"

[X1_KitIIConvR_LA2_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_LA2_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvR_LA2_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"
[X1_KitIIConvL_LA2_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (AR Kit)"

;---------------------------
Conventional LMG Kit
;---------------------------
[X1_KitIIConvLMG_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMG_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"

[X1_KitIIConvLMG_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMG_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"

[X1_KitIIConvLMG_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMG_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"

[X1_KitIIConvLMGR_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGL_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGR_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGL_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGR_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGL_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"

[X1_KitIIConvLMGR_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGL_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGR_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGL_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGR_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"
[X1_KitIIConvLMGL_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (LMG Kit)"

;---------------------------
;Laser AR Kit
;---------------------------
[X1_KitIILaserR_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserR_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserR_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"

[X1_KitIILaserR_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserR_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserR_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"

[X1_KitIILaserThighs_LP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserThighs_LP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserThighs_MP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserThighs_MP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserThighs_HP_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserThighs_HP_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"

;Serpent Armour
[X1_KitIILaserR_LA_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_LA_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserR_LA_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_LA_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"

[X1_KitIILaserR_LA2_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_LA2_M X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserR_LA2_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"
[X1_KitIILaserL_LA2_F X2BodyPartTemplate]
DisplayName="Carapace Medium Plating (Laser AR Kit)"

;---------------------------
Deco Carapace 0 Kit
;---------------------------
[Deco_Carapace0_LP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0_LP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0_MP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0_MP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0_HP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0_HP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0R_LP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_LP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0R_MP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_MP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0R_HP_M 2 X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_HP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0R_LP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_LP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0R_MP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_MP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0R_HP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_HP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0RFore_LP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0LFore_LP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0RFore_MP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0LFore_MP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0RFore_HP_M 2 X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0LFore_HP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0RFore_LP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0LFore_LP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0RFore_MP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0LFore_MP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0RFore_HP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0LFore_HP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0Thighs_LP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Thighs_LP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Thighs_MP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Thighs_MP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Thighs_HP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Thighs_HP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0Shins_LP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Shins_LP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Shins_MP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Shins_MP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Shins_HP_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0Shins_HP_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

;Serpent Armour
[Deco_Carapace0R_LA_M 2 X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_LA_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0R_LA_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_LA_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

[Deco_Carapace0R_LA2_M 2 X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_LA2_M X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0R_LA2_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"
[Deco_Carapace0L_LA2_F X2BodyPartTemplate]
DisplayName="Heavy Carapace Plating"

;---------------------------
Deco Carapace 1 Kit
;---------------------------

[Deco_Carapace1_LP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1_LP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

[Deco_Carapace1_MP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1_MP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

[Deco_Carapace1_HP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1_HP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

[Deco_Carapace1R_LP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_LP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1R_MP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_MP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1R_HP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_HP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

[Deco_Carapace1R_LP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_LP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1R_MP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_MP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1R_HP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_HP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

[Deco_Carapace1Thighs_LP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Thighs_LP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Thighs_MP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Thighs_MP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Thighs_HP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Thighs_HP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

[Deco_Carapace1Shins_LP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Shins_LP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Shins_MP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Shins_MP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Shins_HP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1Shins_HP_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

;Serpent Armour
[Deco_Carapace1R_LA_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_LA_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1R_LA_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_LA_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

[Deco_Carapace1R_LA2_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_LA2_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1R_LA2_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace1L_LA2_F X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"

;---------------------------
Deco Carapace 2 Kit
;---------------------------
[Deco_Carapace2_LP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace2_LP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2_MP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace2_MP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2_HP_M X2BodyPartTemplate]
DisplayName="Carapace Slingshot Plating"
[Deco_Carapace2_HP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2R_LP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_LP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2R_MP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_MP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2R_HP_M 2 X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_HP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2R_LP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_LP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2R_MP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_MP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2R_HP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_HP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2RFore_LP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2LFore_LP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2RFore_MP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2LFore_MP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2RFore_HP_M 2 X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2LFore_HP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2RFore_LP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2LFore_LP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2RFore_MP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2LFore_MP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2RFore_HP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2LFore_HP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2Thighs_LP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Thighs_LP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Thighs_MP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Thighs_MP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Thighs_HP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Thighs_HP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2Shins_LP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Shins_LP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Shins_MP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Shins_MP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Shins_HP_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2Shins_HP_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

;Serpent Armour
[Deco_Carapace2R_LA_M 2 X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_LA_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2R_LA_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_LA_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

[Deco_Carapace2R_LA2_M 2 X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_LA2_M X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2R_LA2_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"
[Deco_Carapace2L_LA2_F X2BodyPartTemplate]
DisplayName="Carapace 2 Slingshot Plating"

;legs test, I wonder, maybe in 10 years, this will work properly.
[X1_SkeletonLegs_LP_M X2BodyPartTemplate]
DisplayName="Skeleton Legs"
[X1_SkeletonLegs_LP_F X2BodyPartTemplate]
DisplayName="Skeleton Legs EW"
[X1_SkeletonLegs_LP_FEU X2BodyPartTemplate]
DisplayName="Skeleton Legs EU"

[X1_SkeletonLegs_MP_M X2BodyPartTemplate]
DisplayName="Skeleton Legs"
[X1_SkeletonLegs_MP_F X2BodyPartTemplate]
DisplayName="Skeleton Legs EW"
[X1_SkeletonLegs_MP_FEU X2BodyPartTemplate]
DisplayName="Skeleton Legs EU"

[X1_SkeletonLegs_HP_M X2BodyPartTemplate]
DisplayName="Skeleton Legs"
[X1_SkeletonLegs_HP_F X2BodyPartTemplate]
DisplayName="Skeleton Legs EW"
[X1_SkeletonLegs_HP_FEU X2BodyPartTemplate]
DisplayName="Skeleton Legs EU"